In [1]:
import sqlalchemy
%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

# 서브쿼리 사용하기 1(단일행 서브쿼리)

Ex1. 사원 테이블에서 최대월급을 받는 사원의 이름과 월급을 출력하시오
```select ename, sal
    from emp
    where sal = max(sal)``` -> 작동하지 않음
```select ename, max(sal)
    from emp ```-> 이 역시 작동하지 않음
- 위의 SQL을 수행하려면 서브쿼리문을 사용해야 함  


Ex2. JONES의 월급을 출력하시오!

In [2]:
%%sql

select ename, sal
    from emp
    where ename = 'JONES'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JONES', Decimal('2975'))]

Ex3. JONES의 월급 보다 더 많은 월급을 받는 사람들의 이름과 월급을 출력하시오

In [3]:
%%sql

select ename, sal
    from emp
    where sal > 2975

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000')),
 ('FORD', Decimal('3000')),
 ('SCOTT', Decimal('3000'))]

In [4]:
%%sql

select ename, sal
    from emp
    where sal > (select sal
                    from emp
                    where ename = 'JONES')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000')),
 ('FORD', Decimal('3000')),
 ('SCOTT', Decimal('3000'))]

- 쿼리를 두번 각각 실행하지 말고 위와 같이 한번에 수행하자!    

문제 265. SCOTT과 같은 월급을 받는 사원들의 이름과 월급을 출력하시오

In [5]:
%%sql

select ename, sal
    from emp
    where sal = (select sal
                    from emp
                    where ename = 'SCOTT')
        and ename != 'SCOTT'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('FORD', Decimal('3000'))]

문제 266. SMITH와 직업이 같은 사원들의 이름과 직업을 출력하는데
             SMITH는 제외하고 출력하시오

In [6]:
%%sql

select ename, job
    from emp
    where job = (select job
                    from emp
                    where ename = 'SMITH')
         and ename != 'SMITH'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JAMES', 'CLERK'), ('ADAMS', 'CLERK'), ('MILLER', 'CLERK')]


문제 267. ALLEN 보다 늦게 입사한 사원들의 입사일을 출력하시오!

In [7]:
%%sql

select ename, hiredate
    from emp
    where hiredate > (select hiredate
                         from emp
                         where ename = 'ALLEN')
          and ename != 'ALLEN'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', datetime.datetime(1981, 11, 17, 0, 0)),
 ('BLAKE', datetime.datetime(1981, 5, 1, 0, 0)),
 ('CLARK', datetime.datetime(1981, 5, 9, 0, 0)),
 ('JONES', datetime.datetime(1981, 4, 1, 0, 0)),
 ('MARTIN', datetime.datetime(1981, 9, 10, 0, 0)),
 ('TURNER', datetime.datetime(1981, 8, 21, 0, 0)),
 ('JAMES', datetime.datetime(1981, 12, 11, 0, 0)),
 ('WARD', datetime.datetime(1981, 2, 23, 0, 0)),
 ('FORD', datetime.datetime(1981, 12, 11, 0, 0)),
 ('SCOTT', datetime.datetime(1982, 12, 22, 0, 0)),
 ('ADAMS', datetime.datetime(1983, 1, 15, 0, 0)),
 ('MILLER', datetime.datetime(1982, 1, 11, 0, 0))]

문제 268. 직업이 SALESMAN인 사원의 최대월급보다 
             더 많은 월급을 받는 사원들의 이름과 월급을 출력하시오

In [8]:
%%sql

select ename, sal
    from emp
    where sal > (select max(sal)
                        from emp
                        where job = 'SALESMAN')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000')),
 ('BLAKE', Decimal('2850')),
 ('CLARK', Decimal('2450')),
 ('JONES', Decimal('2975')),
 ('FORD', Decimal('3000')),
 ('SCOTT', Decimal('3000'))]

문제 269. 최대 월급을 받는 사원의 이름과 월급을 출력하시오

In [9]:
%%sql

select ename, sal
    from emp
    where sal = (select max(sal)
                    from emp)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'))]

문제 270. 전공에 통계가 포함되어져 있는 학생들 중에서의 
              최대 나이인 학생의 이름과 나이와 전공을 출력하시오

In [10]:
%%sql

select substr(ename ,1,1)||'*' as name, 
       substr(age, 1, 1)||'*' as age, 
       '**'||substr(major, 4, 2)||'**' as major
    from emp12
    where major like '%통계%'
          and age = (select max(age)
                        from emp12
                        where major like '%통계%')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('송*', '2*', '**통계**')]

문제 271. KING 에게 보고하는 사원들의 이름을 출력하시오   
(KING 에게 보고하는 사원들은 KING의 직속부하 사원들입니다.)  
	      KING의 직속 부하 사원들의 MGR 번호는 KING의 EMPNO입니다.

In [11]:
%%sql

select ename
    from emp
    where mgr = ( select empno
                      from emp
                      where ename = 'KING')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('BLAKE',), ('CLARK',), ('JONES',)]

# 서브 쿼리 사용하기 2(다중 행 서브쿼리)
- 서브쿼리의 종류 3가지
    1. 단일행 서브 쿼리: 서브 쿼리에서 메인 쿼리로 하나의 값이 리턴되는 경우
    - 연산자: =, <,>, <=, >=, !=, <>, ^=
    2. 다중행 서브 쿼리: 서브 쿼리에서 메인 쿼리로 여러 개의 값이 리턴되는 경우
    - 연산자: in, not, in, >all, <all, >any, <any
    3. 다중 컬럼 서브 쿼리: 서브 쿼리에서 메인 쿼리로 여러 개의 컬럼 값이 리턴되는 경우
                                   
<br>
                                               
Ex) 직업이 SALESMAN인 사원들과 월급이 같은 사원들의 이름과 월급을 출력하시오

In [12]:
%%sql

select ename, sal
    from emp
    where sal in (select sal
                    from emp
                     where job='SALESMAN')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('MARTIN', Decimal('1250')),
 ('WARD', Decimal('1250')),
 ('ALLEN', Decimal('1600')),
 ('TURNER', Decimal('1500'))]

문제 272. 통신사가 sk인 학생들과 
             나이가 같은 학생들의 이름과 나이와 통신사를 출력하시오

In [13]:
%%sql

select replace(ename, 
               substr(ename, 
                              case when length(ename)=4 then 3 else 2 end, 1)
                                                                               ,'*') as name,
       substr(age, 1, 1)||'*' as age, 
       telecom
    from emp12
    where age in (select age
                     from emp12
                     where telecom='sk')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('현*연', '3*', 'sk'),
 ('이*혁', '2*', 'kt'),
 ('성*창', '2*', 'sk'),
 ('송*미', '2*', 'kt'),
 ('김*라', '2*', 'kt'),
 ('유*영', '2*', 'sk'),
 ('김*민', '2*', 'lg'),
 ('김*원', '2*', 'kt'),
 ('권*환', '2*', 'kt'),
 ('구*모', '2*', 'sk'),
 ('정*희', '2*', 'kt'),
 ('허*', '2*', 'kt'),
 ('양*준', '2*', 'sk'),
 ('김*순', '3*', 'sk'),
 ('허*민', '3*', 'sk'),
 ('남궁*미', '2*', 'kt'),
 ('김*승', '2*', 'lg'),
 ('김*린', '2*', 'kt'),
 ('신*종', '2*', 'lg'),
 ('이*성', '2*', 'sk'),
 ('황*현', '2*', 'kt'),
 ('정*원', '2*', 'sk'),
 ('김*비', '2*', 'kt'),
 ('권*원', '3*', 'sk')]

문제 273. 통신사가 sk인 학생들과 
             나이가 같지 않은 학생들의 이름과 나이와 통신사를 출력하시오

In [14]:
%%sql

select replace(ename, 
               substr(ename, 
                              case when length(ename)=4 then 3 else 2 end, 1)
                                                                               ,'*') as name,
       substr(age, 1, 1)||'*' as age,
       telecom
        
    from emp12
    where age not in ( select age
                         from emp12
                         where telecom = 'sk')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('한*', '3*', 'kt'),
 ('김*원', '4*', 'lg'),
 ('이*원', '2*', 'kt'),
 ('장*진', '2*', 'kt')]

# 서브 쿼리 사용하기 3(NOT IN)
Ex) 관리자인 사원들의 이름을 출력하시오
     (이 관리자들의 사원번호는 직속부하 사원들의 mgr입니다)

In [15]:
%%sql

select ename
    from emp
    where empno in (select mgr from emp)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING',), ('BLAKE',), ('JONES',), ('FORD',), ('SCOTT',), ('CLARK',)]

문제 274. 관리자가 아닌 사원들의 이름을 출력하시오
     (관리자인 사원이 6명이 나왔으므로 관리자가 아닌 사원들이 8명 출력되어야 한다.)

In [16]:
%%sql

select ename
    from emp
    where empno not in (select mgr from emp)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[]

```%%sql

select ename
    from emp
    where empno not in (select mgr from emp)---> 출력 오류 KING의 mgr은 null값

```
- 서브쿼리 문에서 not in 연산자 사용 시 주의사항
    - 서브쿼리에서 null 값이 하나라도 리턴되면 결과가 출력되지 않는다.

In [17]:
%%sql

select ename
    from emp
    where empno in (7839, 7902, 7566, null)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING',), ('JONES',), ('FORD',)]

In [18]:
%%sql

select ename
    from emp
    where empno = 7839 or empno = 7902 or empno = 7566 or empno = null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING',), ('JONES',), ('FORD',)]

```
select ename
    from emp
    where empno = 7839 or empno = 7902 or empno = 7566 or empno = null
             True!     or      True!   or     True!    or    null
```

- where 절의 조건이 True이 되어 결과가 잘 출력이 됌

In [19]:
%%sql

select ename
    from emp
    where empno not in (7839, 7902, 7566, null)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[]

In [20]:
%%sql

select ename
    from emp
    where empno != 7839 and empno != 7902 and empno != 7566 and empno != null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[]

```
select ename
    from emp
    where empno != 7839 and empno != 7902 and empno != 7566 and empno != null;
                   True    and       True      and      True      and       null
```
- null 딱 한개 때문에 전체가 다 null이 되어버려서 결과가 출력이 안됌

In [21]:
%%sql
select ename
    from emp
    where empno not in (select mgr
                           from emp
                           where mgr is not null)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ADAMS',),
 ('WARD',),
 ('ALLEN',),
 ('JAMES',),
 ('SMITH',),
 ('MILLER',),
 ('MARTIN',),
 ('TURNER',)]

- 중요!!

> 서브쿼리문 사용 시 not in 연산자를 사용하면 
반드시 서브쿼리에서 메인쿼리로 null 값이 리턴 되지 않도록 처리해야 함

# 서브 쿼리 사용하기 4(EXISTS와 NOT EXISTS)
" 서브쿼리문에서 exists와 not exists를 사용해서 메인쿼리에 있는 데이터 중에 서브쿼리에 존재하는지 존재 유무를 파악할 때 사용하는 SQL 문법 "   

<br> 

문제 276. 부서 테이블에 부서번호와 부서위치를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
부서 테이블에 있는 부서번호중에 사원 테이블에도 존재하는   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
부서번호에 대한 것만 출력하시오

In [22]:
%%sql

select d.deptno, d.loc
    from dept d
    where exists( select *
                    from emp e
                    where e.deptno = d.deptno )

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 'NEW YORK'), (30, 'CHICAGO'), (20, 'DALLAS')]

문제277. 이번에는 존재 하지 않는 부서번호와 부서 위치를 출력하시오!

In [23]:
%%sql

select d.deptno, d.loc
    from dept d
    where not exists ( select *
                              from emp e 
                              where d.deptno = e.deptno)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(40, 'BOSTON')]

# 서브 쿼리 사용하기 5(HAVING절의 서브 쿼리)
" Select 문장에서 서브쿼리를 쓸 수 있는 절 "
```
Select       ---> 서브쿼리 사용가능 ( Scalar subquery )
    From     ---> 서브쿼리 사용가능 ( In line view )
    Where    ---> 서브쿼리 사용가능
    Group by ---> X
    Having   ---> 서브쿼리 사용가능
    Order by ---> 서브쿼리 사용가능 ( Scalar subquery )
```
문제 280. JAMES 보다 더 많은 월급을 받는 사원들의 이름과 월급을 출력하시오

In [24]:
%%sql

select ename, sal
    from emp
    where sal > ( select sal 
                    from emp
                    where ename = 'JAMES' )

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000')),
 ('BLAKE', Decimal('2850')),
 ('CLARK', Decimal('2450')),
 ('JONES', Decimal('2975')),
 ('MARTIN', Decimal('1250')),
 ('ALLEN', Decimal('1600')),
 ('TURNER', Decimal('1500')),
 ('WARD', Decimal('1250')),
 ('FORD', Decimal('3000')),
 ('SCOTT', Decimal('3000')),
 ('ADAMS', Decimal('1100')),
 ('MILLER', Decimal('1300'))]

문제 281. 직업, 직업별 토탈월급을 출력하시오

In [25]:
%%sql

select job, sum(sal)
    from emp
    group by job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SALESMAN', 5600),
 ('CLERK', 4150),
 ('ANALYST', 6000),
 ('MANAGER', 8275),
 ('PRESIDENT', 5000)]

문제 282. 위의 결과를 다시 출력하는데 직업별 평균월급이 SALESMAN의 토탈월급보다
              더 큰 직업들만 출력하시오

In [26]:
%%sql

select job, sum(sal)
    from emp
    group by job
    having sum(sal) > ( select sum(sal)
                          from emp
                          where job='SALESMAN' )

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 6000), ('MANAGER', 8275)]

- 만약 쿼리를 아래와 같은 식으로 썼다면 에러가 발생한다.
```
select job, sum(sal)
    from emp
    where sum( sal ) > ( select sum(sal)
                                from emp
                                where job = 'SALESMAN' )
    group by job;
```
---> 오류 발생: "그룹함수는 허가되지 않습니다"
- 그룹함수로 조건을 주는 절은 having 절, where 절에 작성하면 에러가 발생


문제 283. 부서번호와 부서번호별 인원수를 출력하는데 10번 부서번호의 인원수보다 더 큰 것만 출력하시오!

In [27]:
%%sql

select deptno, count(*)
    from emp
    group by deptno
    having count(*) > ( select count(*) 
                          from emp
                          where deptno = 10 )

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(30, 6), (20, 5)]

# 서브 쿼리 사용하기 6(FROM절의 서브 쿼리)
" from 절에도 서브쿼리를 사용할 수 있음.  
&nbsp;&nbsp;from 절의 서브쿼리는 in line view라고 함 "  

Ex) 이름, 월급, 순위를 출력하는데 순위가 월급이 높은 사원 순으로 순위를 부여하시오

In [28]:
%%sql

select ename, sal, dense_rank () over (order by sal desc) as rank
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), 1),
 ('SCOTT', Decimal('3000'), 2),
 ('FORD', Decimal('3000'), 2),
 ('JONES', Decimal('2975'), 3),
 ('BLAKE', Decimal('2850'), 4),
 ('CLARK', Decimal('2450'), 5),
 ('ALLEN', Decimal('1600'), 6),
 ('TURNER', Decimal('1500'), 7),
 ('MILLER', Decimal('1300'), 8),
 ('WARD', Decimal('1250'), 9),
 ('MARTIN', Decimal('1250'), 9),
 ('ADAMS', Decimal('1100'), 10),
 ('JAMES', Decimal('950'), 11),
 ('SMITH', Decimal('800'), 12)]

Ex) 위의 결과에서 순위가 4등인 사원만 출력하시오!

In [29]:
%%sql

select *
    from ( select ename, 
                  sal, 
                  dense_rank () over (order by sal desc) as rank
             from emp )
    where rank = 4

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('BLAKE', Decimal('2850'), 4)]

```
"3" select ename, sal, dense_rank () over (order by sal desc) as rank
"1"     from emp
"2"     where rank = 4;
```
- 위의 SQL은 실행 순서로 인하여 에러가 발생
    * from절 이 실행하고 where 절을 실행하기 때문에 emp 테이블에는 순위라는 컬럼이 없기 때문에 에러가 발생  
&nbsp;$\Rightarrow$ 순위가 4등인 사원의 이름과 월급 순위를 출력하려면 from 절의 서브쿼리를 사용해야 함

```
"5" select *
"1"     from ( "3"   select ename, sal, dense_rank () over (order by sal desc) as rank
               "2"      from emp  )
"4"     where rank = 4
```
- from 절의 서브쿼리문의 결과가 마치 하나의 테이블 처럼 만들어져서 서브쿼리문의 결과 데이터가 메모리에 올라가게 됨
- 메모리에 올려놓은 데이터 중에 순위가 4등인 데이터를 가져옴

문제 284. 직업, 이름, 월급, 순위를 출력하는데 
             순위가 직업별로 각각 윌급이 높은 순서대로 순위를 부여하시오

In [30]:
%%sql

select job, ename, sal, dense_rank () over ( partition by job 
                                             order by sal desc)
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 'SCOTT', Decimal('3000'), 1),
 ('ANALYST', 'FORD', Decimal('3000'), 1),
 ('CLERK', 'MILLER', Decimal('1300'), 1),
 ('CLERK', 'ADAMS', Decimal('1100'), 2),
 ('CLERK', 'JAMES', Decimal('950'), 3),
 ('CLERK', 'SMITH', Decimal('800'), 4),
 ('MANAGER', 'JONES', Decimal('2975'), 1),
 ('MANAGER', 'BLAKE', Decimal('2850'), 2),
 ('MANAGER', 'CLARK', Decimal('2450'), 3),
 ('PRESIDENT', 'KING', Decimal('5000'), 1),
 ('SALESMAN', 'ALLEN', Decimal('1600'), 1),
 ('SALESMAN', 'TURNER', Decimal('1500'), 2),
 ('SALESMAN', 'MARTIN', Decimal('1250'), 3),
 ('SALESMAN', 'WARD', Decimal('1250'), 3)]

문제 284. 직업, 이름, 월급, 순위를 출력하는데 순위가 직업별로 각각 윌급이 높은 순서대로 순위를 부여하는데 순위가 1등인 사원들만 출력하시오

In [31]:
%%sql

select *
    from ( select job, ename, sal, dense_rank () over (partition by job
                                                       order by sal desc) as rank
             from emp )
    where rank = 1

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 'FORD', Decimal('3000'), 1),
 ('ANALYST', 'SCOTT', Decimal('3000'), 1),
 ('CLERK', 'MILLER', Decimal('1300'), 1),
 ('MANAGER', 'JONES', Decimal('2975'), 1),
 ('PRESIDENT', 'KING', Decimal('5000'), 1),
 ('SALESMAN', 'ALLEN', Decimal('1600'), 1)]

문제 286. 우리반 테이블에서 
             통신사별로 나이가 가장 많은 학생의 이름, 나이, 통신사, 나이의 순위를 출력하시오

In [32]:
%%sql

select replace(ename, 
               substr(ename, 
                              case when length(ename)=4 then 3 else 2 end, 1)
                                                                               ,'*') as name,
       substr(age, 1, 1)||'*' as age, 
       telecom,
       rank
    from (select ename, age, telecom, dense_rank () over ( partition by telecom
                                                 order by age desc ) as rank
                from emp12 )
    where rank = 1

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('한*', '3*', 'kt', 1), ('김*원', '4*', 'lg', 1), ('권*원', '3*', 'sk', 1)]

문제 287. price 테이블의 전체 건수가 어떻게 되는지 확인하시오

In [35]:
%%sql
select count(*)   
    from price

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(9517,)]

문제 288. 서울시에서 가장 비싼 식료품의 이름과 가격과 파는 곳을 출력하시오

In [50]:
%%sql

select p.a_name, p.m_name, a.a_price
    from ( select max(a_price) as a_price
             from price) a, price p
    where p.a_price = a.a_price

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('조기(국산,생물)', '신세계백화점', 81670)]

In [51]:
%%sql

select *
    from ( select m_name, a_name, a_price, dense_rank() over (order by a_price desc) as rank 
             from price )
    where rank = 1

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('신세계백화점', '조기(국산,생물)', 81670, 1)]